src/InformationRegisters/инкСтандартныеВычетыНастройки/инкСтандартныеВычетыНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкСтандартныеВычетыНастройки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МаксимальнаяСуммаНаДетей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мрот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/инкСтандартныеВычетыНастройки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.0.2.71
//
// Установка размеров предельных сумм вычетов и мрот.
//
Процедура УстановитьНастройкиСтандартныхВычетов_11_0_2_71() Экспорт
	
	инкСтандартныеВычетыНастройкиМенеджер = РегистрыСведений.инкСтандартныеВычетыНастройки.СоздатьМенеджерЗаписи();
	инкСтандартныеВычетыНастройкиМенеджер.Период = НачалоГода(Дата("20250101000000"));
	инкСтандартныеВычетыНастройкиМенеджер.Мрот                          = 22440;
	инкСтандартныеВычетыНастройкиМенеджер.МаксимальнаяСуммаНаДетей      = 450000;
	инкСтандартныеВычетыНастройкиМенеджер.Записать(Истина);
	  
КонецПроцедуры

// Обработчик обновления УТ 11.0.0.2
//
// Установка размеров предельных сумм вычетов и мрот.
//
Процедура УстановитьНастройкиСтандартныхВычетов_11_0_0_2() Экспорт
	
	инкСтандартныеВычетыНастройкиМенеджер = РегистрыСведений.инкСтандартныеВычетыНастройки.СоздатьМенеджерЗаписи();
	инкСтандартныеВычетыНастройкиМенеджер.Период = НачалоГода(Дата("20200101000000"));
	инкСтандартныеВычетыНастройкиМенеджер.Мрот                          = 12130;
	инкСтандартныеВычетыНастройкиМенеджер.МаксимальнаяСуммаНаДетей      = 350000;
	инкСтандартныеВычетыНастройкиМенеджер.Записать(Истина);
	  
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
